
//Композиция и агрегация - частные случаи ассоциации. Ассоциация - это когда 1 класс включает в себя 2 класс(имеет поле объекта 2 класса)\
//При композиции 1 класс полностью управляет жизненным циклом объекта другого цикла. Управляемый объект создается в конструкторе класса
//При агрегации классу в качестве аргумента конструктора передают объект другого класса, созданный извне, а значит зависимость меньше.

using System;

namespace Composition_and_agregation
{
    class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}
